---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.Erase(System.String)
source: html/02e8ca98-95fb-93df-050d-f355f91c3feb.htm
---
# Autodesk.Revit.DB.ParameterMap.Erase Method

Removes a object with the specified key from the map.

## Syntax (C#)
```csharp
public virtual int Erase(
	string key
)
```

## Parameters
- **key** (`System.String`) - The key of the item to be erased.

## Returns
The number of items that were erased from the map.